run/tests/fixtures/StripePaymentSucceededWebhookBody.json

{
  "id": "evt_1JiLz5JG8RHJCKOzHuD0afSY",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1633710706,
  "data": {
    "object": {
      "id": "in_1JiLz3JG8RHJCKOz5YNrZj4A",
      "object": "invoice",
      "account_country": "FR",
      "account_name": "Ethernal",
      "account_tax_ids": null,
      "amount_due": 0,
      "amount_paid": 0,
      "amount_remaining": 0,
      "application_fee_amount": null,
      "attempt_count": 0,
      "attempted": true,
      "auto_advance": false,
      "automatic_tax": {
        "enabled": false,
        "status": null
      },
      "billing_reason": "subscription_create",
      "charge": null,
      "collection_method": "charge_automatically",
      "created": 1633710705,
      "currency": "usd",
      "custom_fields": null,
      "customer": "cus_KN6AD8pwBHd2sF",
      "customer_address": null,
      "customer_email": "adechevigne+5@gmail.com",
      "customer_name": null,
      "customer_phone": null,
      "customer_shipping": null,
      "customer_tax_exempt": "none",
      "customer_tax_ids": [
      ],
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [
      ],
      "description": null,
      "discount": null,
      "discounts": [
      ],
      "due_date": null,
      "ending_balance": 0,
      "footer": null,
      "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1Jbna3JG8RHJCKOz/test_YWNjdF8xSmJuYTNKRzhSSEpDS096LF9LTjZCeHpYemVMS0dORXRFaExudXR3Qkw1OGZ4bWVI0100uQxGMw2u",
      "invoice_pdf": "https://pay.stripe.com/invoice/acct_1Jbna3JG8RHJCKOz/test_YWNjdF8xSmJuYTNKRzhSSEpDS096LF9LTjZCeHpYemVMS0dORXRFaExudXR3Qkw1OGZ4bWVI0100uQxGMw2u/pdf",
      "last_finalization_error": null,
      "lines": {
        "object": "list",
        "data": [
          {
            "id": "il_1JiLz3JG8RHJCKOzzlAdwS2H",
            "object": "line_item",
            "amount": 0,
            "currency": "usd",
            "description": "Trial period for Premium",
            "discount_amounts": [
            ],
            "discountable": true,
            "discounts": [
            ],
            "livemode": false,
            "metadata": {
            },
            "period": {
              "end": 1634920305,
              "start": 1633710705
            },
            "plan": {
              "id": "price_1JiLucJG8RHJCKOzPf0PPfS2",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 2000,
              "amount_decimal": "2000",
              "billing_scheme": "per_unit",
              "created": 1633710430,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "nickname": null,
              "product": "prod_KN66pc8jaNvVfX",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "id": "price_1JiLucJG8RHJCKOzPf0PPfS2",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1633710430,
              "currency": "usd",
              "livemode": false,
              "lookup_key": null,
              "metadata": {
              },
              "nickname": null,
              "product": "prod_KN66pc8jaNvVfX",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 2000,
              "unit_amount_decimal": "2000"
            },
            "proration": false,
            "quantity": 1,
            "subscription": "sub_1JiLz3JG8RHJCKOzxbj6KSkr",
            "subscription_item": "si_KN6BfzRM4wlxJc",
            "tax_amounts": [
            ],
            "tax_rates": [
            ],
            "type": "subscription"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/invoices/in_1JiLz3JG8RHJCKOz5YNrZj4A/lines"
      },
      "livemode": false,
      "metadata": {
      },
      "next_payment_attempt": null,
      "number": "57A129CE-0002",
      "on_behalf_of": null,
      "paid": true,
      "payment_intent": null,
      "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null
      },
      "period_end": 1633710705,
      "period_start": 1633710705,
      "post_payment_credit_notes_amount": 0,
      "pre_payment_credit_notes_amount": 0,
      "quote": null,
      "receipt_number": null,
      "starting_balance": 0,
      "statement_descriptor": null,
      "status": "paid",
      "status_transitions": {
        "finalized_at": 1633710705,
        "marked_uncollectible_at": null,
        "paid_at": 1633710705,
        "voided_at": null
      },
      "subscription": "sub_1JiLz3JG8RHJCKOzxbj6KSkr",
      "subtotal": 0,
      "tax": null,
      "total": 0,
      "total_discount_amounts": [
      ],
      "total_tax_amounts": [
      ],
      "transfer_data": null,
      "webhooks_delivered_at": null
    }
  },
  "livemode": false,
  "pending_webhooks": 2,
  "request": {
    "id": null,
    "idempotency_key": null
  },
  "type": "invoice.payment_succeeded"
}
